EEC_PROP/src/main/resources/OP_02/FLC/MSG.001_TRN.001/Log/Init_MSG_001.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
	<soap:Header xmlns:int="urn:EEC:Interaction:v1.0" xmlns:wsa="http://www.w3.org/2005/08/addressing">
		<wsa:To>EAEU://EEC/CP/P.CC.01/P.ACT.001</wsa:To>
		<wsa:ReplyTo>
			<wsa:Address>EAEU://RU/CP/P.CC.01/P.CC.01.ACT.001AT</wsa:Address>
		</wsa:ReplyTo>
		<wsa:Action>int://CP/P.CC.01/1.0.0/P.CC.01.PRC.001/P.CC.01.TRN.001/P.CC.01.MSG.001</wsa:Action>
		<wsa:MessageID>urn:uuid:dea4db5a-d65f-4557-a199-b5a71f0a2ddc</wsa:MessageID>
		<int:ProcedureID>urn:uuid:eea45c7a-3094-40ab-8e2f-bdd3979095f6</int:ProcedureID>
		<int:ConversationID>urn:uuid:eff7c064-acf2-42a7-8a37-0e52260ac90f</int:ConversationID>
	</soap:Header>
	<soap:Body>
		<cpl:CheckPointList xmlns:cacdo="urn:EEC:M:CA:ComplexDataObjects:v1.2.6" xmlns:casdo="urn:EEC:M:CA:SimpleDataObjects:v1.2.6" xmlns:ccdo="urn:EEC:M:ComplexDataObjects:v0.3.3" xmlns:cpl="urn:EEC:R:CA:CC:01:CheckPointList:v1.0.0" xmlns:csdo="urn:EEC:M:SimpleDataObjects:v0.3.3" xmlns:doc="urn:EEC:R:ProcessingResultDetails:v0.3.4" xmlns:ns6="urn:EEC:R:ResourceStatusDetails:v0.3.3">
			<ccdo:EDocHeader>
				<csdo:InfEnvelopeCode>P.CC.01.MSG.001</csdo:InfEnvelopeCode>
				<csdo:EDocCode>R.CA.CC.01.001</csdo:EDocCode>
				<csdo:EDocId>c10cb842-8651-46fb-9339-3c72100d2625</csdo:EDocId>
				<csdo:EDocDateTime>2019-10-31T10:53:58Z</csdo:EDocDateTime>
			</ccdo:EDocHeader>
			<cacdo:CheckPointDetails>
				<casdo:RegisterCountryCode>RU</casdo:RegisterCountryCode>
				<casdo:BorderCheckPointCode>PPG.RU.UA.34636356</casdo:BorderCheckPointCode>
				<casdo:BorderCheckPointName>Романово</casdo:BorderCheckPointName>
				<cacdo:NeighboringCheckPointDetails>
					<casdo:BorderCheckPointName>Сергеево</casdo:BorderCheckPointName>
					<csdo:CountryCode>UA</csdo:CountryCode>
				</cacdo:NeighboringCheckPointDetails>
				<casdo:CheckPointTrafficCode>030</casdo:CheckPointTrafficCode>
				<casdo:CheckPointCharacterCode>10</casdo:CheckPointCharacterCode>
				<casdo:CheckPointStatusCode>30</casdo:CheckPointStatusCode>
				<casdo:CheckPointFunctionCode>20</casdo:CheckPointFunctionCode>
				<cacdo:PointLocationAddressDetails>
					<ccdo:AddressDetails>
						<csdo:CountryCode>RU</csdo:CountryCode>
						<csdo:TerritoryCode>31</csdo:TerritoryCode>
						<csdo:PostCode>309070</csdo:PostCode>
						<csdo:RegionName>Регион</csdo:RegionName>
						<csdo:DistrictName>Район</csdo:DistrictName>
						<csdo:CityName>Город</csdo:CityName>
						<csdo:SettlementName>Пункт</csdo:SettlementName>
						<csdo:StreetName>Улица</csdo:StreetName>
						<csdo:BuildingNumberId>Дом</csdo:BuildingNumberId>
						<csdo:RoomNumberId>Помещение</csdo:RoomNumberId>
					</ccdo:AddressDetails>
					<cacdo:GeoCoordinateDetails>
						<casdo:LatitudeMeasure>55.11</casdo:LatitudeMeasure>
						<casdo:LongitudeMeasure>22.11</casdo:LongitudeMeasure>
					</cacdo:GeoCoordinateDetails>
				</cacdo:PointLocationAddressDetails>
				<cacdo:CheckPointWorkDetails>
					<cacdo:WorkScheduleDetails>
						<casdo:WorkSheduleCode>11</casdo:WorkSheduleCode>
						<casdo:WorkSheduleDescriptionText>Описание</casdo:WorkSheduleDescriptionText>
						<cacdo:PeriodDetails>
							<csdo:StartDateTime>2019-04-04T09:28:00Z</csdo:StartDateTime>
							<csdo:EndDateTime>2019-04-05T09:28:00Z</csdo:EndDateTime>
						</cacdo:PeriodDetails>
						<cacdo:WorkTimeDetails>
							<csdo:WeekDayCode>1</csdo:WeekDayCode>
							<cacdo:WorkTimeHourDetails>
								<casdo:StartingTime>08:00:48.048+03:00</casdo:StartingTime>
								<casdo:EndingTime>20:00:48.048+03:00</casdo:EndingTime>
							</cacdo:WorkTimeHourDetails>
							<casdo:WorkTimeHourDescriptionText>Доп</casdo:WorkTimeHourDescriptionText>
						</cacdo:WorkTimeDetails>
						<cacdo:WorkTimeDetails>
							<csdo:WeekDayCode>2</csdo:WeekDayCode>
							<cacdo:WorkTimeHourDetails>
								<casdo:StartingTime>08:00:49.049+03:00</casdo:StartingTime>
								<casdo:EndingTime>20:00:49.049+03:00</casdo:EndingTime>
							</cacdo:WorkTimeHourDetails>
							<casdo:WorkTimeHourDescriptionText>Доп</casdo:WorkTimeHourDescriptionText>
						</cacdo:WorkTimeDetails>
						<cacdo:WorkTimeDetails>
							<csdo:WeekDayCode>3</csdo:WeekDayCode>
							<cacdo:WorkTimeHourDetails>
								<casdo:StartingTime>08:00:49.049+03:00</casdo:StartingTime>
								<casdo:EndingTime>20:00:49.049+03:00</casdo:EndingTime>
							</cacdo:WorkTimeHourDetails>
							<casdo:WorkTimeHourDescriptionText>Доп</casdo:WorkTimeHourDescriptionText>
						</cacdo:WorkTimeDetails>
						<cacdo:WorkTimeDetails>
							<csdo:WeekDayCode>4</csdo:WeekDayCode>
							<cacdo:WorkTimeHourDetails>
								<casdo:StartingTime>08:00:50.05+03:00</casdo:StartingTime>
								<casdo:EndingTime>20:00:50.05+03:00</casdo:EndingTime>
							</cacdo:WorkTimeHourDetails>
							<casdo:WorkTimeHourDescriptionText>Доп</casdo:WorkTimeHourDescriptionText>
						</cacdo:WorkTimeDetails>
						<cacdo:WorkTimeDetails>
							<csdo:WeekDayCode>5</csdo:WeekDayCode>
							<cacdo:WorkTimeHourDetails>
								<casdo:StartingTime>08:00:50.05+03:00</casdo:StartingTime>
								<casdo:EndingTime>20:00:50.05+03:00</casdo:EndingTime>
							</cacdo:WorkTimeHourDetails>
							<casdo:WorkTimeHourDescriptionText>Доп</casdo:WorkTimeHourDescriptionText>
						</cacdo:WorkTimeDetails>
						<cacdo:WorkTimeDetails>
							<csdo:WeekDayCode>6</csdo:WeekDayCode>
							<cacdo:WorkTimeHourDetails>
								<casdo:StartingTime>08:00:50.05+03:00</casdo:StartingTime>
								<casdo:EndingTime>20:00:50.05+03:00</casdo:EndingTime>
							</cacdo:WorkTimeHourDetails>
							<casdo:WorkTimeHourDescriptionText>Доп</casdo:WorkTimeHourDescriptionText>
						</cacdo:WorkTimeDetails>
						<cacdo:WorkTimeDetails>
							<csdo:WeekDayCode>7</csdo:WeekDayCode>
							<cacdo:WorkTimeHourDetails>
								<casdo:StartingTime>08:00:51.051+03:00</casdo:StartingTime>
								<casdo:EndingTime>20:00:51.051+03:00</casdo:EndingTime>
							</cacdo:WorkTimeHourDetails>
							<casdo:WorkTimeHourDescriptionText>Доп</casdo:WorkTimeHourDescriptionText>
						</cacdo:WorkTimeDetails>
					</cacdo:WorkScheduleDetails>
					<casdo:WorkTimeCode>12</casdo:WorkTimeCode>
				</cacdo:CheckPointWorkDetails>
				<cacdo:CheckPointSpecialControlDetails>
					<casdo:GovControlKindCode>2</casdo:GovControlKindCode>
					<casdo:GovControlKindName>таможенный</casdo:GovControlKindName>
					<cacdo:ReasonDocDetails>
						<csdo:DocKindName>Приказ</csdo:DocKindName>
						<csdo:DocId>65\2</csdo:DocId>
						<csdo:DocName>Разрешение на провоз груза</csdo:DocName>
						<csdo:AuthorityId>ФСБ</csdo:AuthorityId>
						<csdo:AuthorityName>УО</csdo:AuthorityName>
						<csdo:DocCreationDate>2019-04-03</csdo:DocCreationDate>
						<casdo:DocEffectiveDate>2019-04-03</casdo:DocEffectiveDate>
						<csdo:DescriptionText>Описание</csdo:DescriptionText>
					</cacdo:ReasonDocDetails>
					<csdo:DescriptionText>Описание</csdo:DescriptionText>
				</cacdo:CheckPointSpecialControlDetails>
				<casdo:StartActivityDate>2019-10-31</casdo:StartActivityDate>
				<ccdo:ResourceItemStatusDetails>
					<ccdo:ValidityPeriodDetails>
						<csdo:StartDateTime>2019-10-31T00:00:00+03:00</csdo:StartDateTime>
					</ccdo:ValidityPeriodDetails>
				</ccdo:ResourceItemStatusDetails>
			</cacdo:CheckPointDetails>
		</cpl:CheckPointList>
	</soap:Body>
</soap:Envelope>
